RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_selftest_v3.c
                         (CY_CAPSENSE_SM_CSX_FULL_WAVE_CTRL_MUX_REG_MODE0_SW_SEL_SH_FLD_BUF_EN  << MSC_MODE_SW_SEL_SH_BUF_EN_Pos)), \
            }, \
            [2u] = \
            { \
                .senseDutyCtl   = 0x00uL, \
                .swSelCdacFl    = 0x00uL, \
                .swSelTop       = 0x00uL, \
                .swSelComp      = 0x00uL, \
                .swSelSh        = 0x00uL, \
            }, \
            [3u] = \
            { \
                .senseDutyCtl   = 0x00uL, \
                .swSelCdacFl    = 0x00uL, \
                .swSelTop       = 0x00uL, \
                .swSelComp      = 0x00uL, \
                .swSelSh        = 0x00uL, \
            }, \
        }, \
    }


/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/******************************************************************************/
/** \cond SECTION_CAPSENSE_INTERNAL */
/** \addtogroup group_capsense_internal *//** \{ */
/******************************************************************************/

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN)
    static cy_en_capsense_bist_status_t Cy_CapSense_CheckAllWidgetCRC(
                cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN)) */

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_SHORT_EN)
    static cy_en_capsense_bist_status_t Cy_CapSense_SnsShortCheckSensor(
                    uint32_t widgetId,
                    uint32_t sensorId,
                    uint32_t mode,
                    cy_stc_capsense_context_t * context);
    static cy_en_capsense_bist_status_t Cy_CapSense_SnsShortCheckElectrode(
                    uint32_t widgetId,
                    uint32_t ioSnsId,
                    uint32_t mode,
                    const cy_stc_capsense_context_t * context);
    static void Cy_CapSense_SnsShortUpdateTestResult(
                    uint32_t widgetId,
                    uint32_t sensorId,
                    cy_stc_capsense_context_t * context);
    static cy_en_capsense_bist_status_t Cy_CapSense_SnsShortCheckAllSensors(
                    cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_SHORT_EN) */

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN)
    static void Cy_CapSense_BistSwitchHwConfig(
                    cy_en_capsense_bist_hw_config_t hwCfg,
                    uint8_t bistSenseGroup,
                    uint8_t bistScanMode,
                    cy_stc_capsense_context_t * context);
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_SHORT_EN)
        static void Cy_CapSense_BistSetPinDr(
                        cy_stc_capsense_pin_config_t const *ioPtr,
                        uint32_t value);
        static void Cy_CapSense_BistSetPinPc(
                        cy_stc_capsense_pin_config_t const *ioPtr,
                        uint32_t value);
    #endif
    static void Cy_CapSense_BistSwitchAllSnsPinState(
                    cy_en_capsense_bist_io_state_t desiredPinState,
                    const cy_stc_capsense_context_t * context);
    static void Cy_CapSense_BistSwitchAllExternalCapPinState(
                    cy_en_capsense_bist_io_state_t desiredPinState,
                    const cy_stc_capsense_context_t * context);
    void Cy_CapSense_BistSetAllSnsPinsState(
                    uint32_t desiredDriveMode,
                    uint32_t desiredPinOutput,
                    en_hsiom_sel_t desiredHsiom,
                    const cy_stc_capsense_context_t * context);
    void Cy_CapSense_BistSetAllCmodPinsState(
                    uint32_t desiredDriveMode,
                    uint32_t desiredPinOutput,
                    en_hsiom_sel_t desiredHsiom,
                    const cy_stc_capsense_context_t * context);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
        static void Cy_CapSense_BistSwitchAllShieldPinState(
                        cy_en_capsense_bist_io_state_t desiredPinState,
                        const cy_stc_capsense_context_t * context);
        void Cy_CapSense_BistSetAllShieldPinsState(
                        uint32_t desiredDriveMode,
                        uint32_t desiredPinOutput,
                        en_hsiom_sel_t desiredHsiom,
                        const cy_stc_capsense_context_t * context);
    #endif

    static void Cy_CapSense_BistSetDmHsiomPinState(
                    cy_en_capsense_bist_io_state_t desiredPinState,
                    const cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN) */

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN)
    static cy_en_capsense_bist_status_t Cy_CapSense_MeasureCapacitanceAllElectrodes(
                cy_stc_capsense_context_t * context);
#endif

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN)
    static cy_en_capsense_bist_status_t Cy_CapSense_MeasureCapacitanceAllSensors(
                cy_stc_capsense_context_t * context);
#endif

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN)
    static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureCapacitanceSensor(
                    uint32_t * cpPtr,
                    cy_stc_capsense_context_t * context);
#endif

#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || \
    ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN)))
    static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureCapacitanceSlot(
                    uint32_t slotId,
                    cy_stc_capsense_context_t * context);
#endif

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN)
    static cy_capsense_status_t Cy_CapSense_BistMeasureCapacitanceSensorEnable(
                    cy_stc_capsense_context_t * context);
    static void Cy_CapSense_BistMeasureCapacitanceSensorRun(
                    cy_stc_capsense_context_t * context);
    static void Cy_CapSense_BistGenerateBaseConfig(
                    uint32_t chIndex,
                    cy_stc_capsense_context_t * context);
    static void Cy_CapSense_BistGenerateSensorConfig(
                    uint32_t chIndex,
                    uint32_t * ptrSensorCfg,
                    cy_stc_capsense_context_t * context);

