RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_selftest_v3.c
    /* Set the modClk divider for BIST scans */
    Cy_CapSense_SetModClkDivider(context->ptrBistContext->eltdCapModClk, context);
    /* Generate the MSC base configuration for BIST scan and send it to the MSC HW block */
    for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
    {
        mscStatus = Cy_MSC_Configure(context->ptrCommonConfig->ptrMscChConfig[curChIndex].ptrMscBase,
                                     &cy_capsense_BistBaseTemplate, CY_MSC_CAPSENSE_KEY,
                                     context->ptrCommonConfig->ptrMscChConfig[curChIndex].ptrMscContext);
        if (CY_MSC_SUCCESS != mscStatus)
        {
            capStatus = CY_CAPSENSE_STATUS_HW_BUSY;
            break;
        }
        Cy_CapSense_BistGenerateBaseConfig(curChIndex, context);
    }
    /* Check if all MSC channel is not busy and clear all pending interrupts */
    if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
    {
        for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
        {
            /* Clear all pending interrupts of the MSC HW block */
            context->ptrCommonConfig->ptrMscChConfig[curChIndex].ptrMscBase->INTR =
                                 CY_CAPSENSE_MSC_INTR_ALL_MSK;
            (void)context->ptrCommonConfig->ptrMscChConfig[curChIndex].ptrMscBase->INTR;
        }
    }

    return (capStatus);
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceSensor
****************************************************************************//**
*
* This internal function measures a capacitance attached to AMUXBUS.
*
* The function measures Cp of a certain electrode (CSD sensor or CSX
* Rx/Tx electrode) by using CSD FW mode and defined scan configuration,
* sense clock frequency and resolution.
* The range for sensor measuring is 1 to 200 pF.
* The function performs the CSD scan with the fixed CDAC value. This provides
* a possibility of classical raw counts formula usage for the capacitance
* calculation. The function stores the Cp value
* in the corresponding element of the eltdCap[CY_CAPSENSE_ELTD_COUNT] array.
*
* \param cpPtr
* The pointer to the uint32_t to store measured value of the capacitance.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E - The measurement is completed
*                                successfully, the result is valid.
* - CY_CAPSENSE_BIST_TIMEOUT_E - The scan reached the timeout. It can be caused
*                                by a measured capacitance short or HW block
*                                failure or invalid configuration. You may need
*                                to repeat the measurement after the issue fix.
*
*******************************************************************************/
static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureCapacitanceSensor(
                uint32_t * cpPtr,
                cy_stc_capsense_context_t * context)
{
    uint64_t cp;
    uint32_t watchdogPeriod;
    cy_en_capsense_bist_status_t result = CY_CAPSENSE_BIST_TIMEOUT_E;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    uint32_t rawCountTmp;
    uint32_t chIndex;

    /* Setup scan parameters: Ref CDAC code for Cp measurement */
    context->ptrBistContext->eltdCapRefCdac = CY_CAPSENSE_BIST_ELTD_CAP_REF_CDAC_DEFAULT;
    /* Perform BIST scan */
    Cy_CapSense_BistMeasureCapacitanceSensorRun(context);
    watchdogPeriod = Cy_CapSense_BistWatchdogPeriodCalc(context);
    /* Wait for the end of scan and get the raw count */
    while (((ptrCommonCfg->ptrMscChConfig[context->ptrBistContext->curBistChId].ptrMscBase->INTR &
            MSC_INTR_MASK_SCAN_Msk) == 0u) && (0u != watchdogPeriod))
    {
        watchdogPeriod--;
    }
    if (0u != watchdogPeriod)
    {
        rawCountTmp =
            ptrCommonCfg->ptrMscChConfig[context->ptrBistContext->curBistChId].ptrMscBase->RESULT_FIFO_RD;
        result = CY_CAPSENSE_BIST_SUCCESS_E;
    }
    /* Clear all pending interrupts of all MSC HW blocks */
    for (chIndex = 0u; chIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; chIndex++)
    {
        ptrCommonCfg->ptrMscChConfig[chIndex].ptrMscBase->INTR = CY_CAPSENSE_MSC_INTR_ALL_MSK;
        (void)ptrCommonCfg->ptrMscChConfig[chIndex].ptrMscBase->INTR;
    }
    /* Check for timeout and if no, then calculate capacitance and store the value to the data structure */
    if ((CY_CAPSENSE_BIST_TIMEOUT_E != result))
    {
        cp = (uint64_t)CY_CAPSENSE_BIST_CAP_MEAS_CDAC_LSB_FF_DIV_1000 * context->ptrBistContext->eltdCapRefCdac;
        cp *= rawCountTmp;
        cp /= CY_CAPSENSE_CONVERSION_KILO;
        cp /= context->ptrBistContext->eltdCapSubConvNum;
        if (((uint64_t)CY_CAPSENSE_BIST_CP_MAX_VALUE) < cp)
        {
            cp = (uint64_t)CY_CAPSENSE_BIST_CP_MAX_VALUE;
        }
        *cpPtr = (uint32_t)cp;
    }

    return (result);
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN_EN) */


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || \
    ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN)))
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceSlot
****************************************************************************//**
*
* This internal function measures slot sensor capacitances.
*
* The function measures Cp of a certain CSD sensor or shield
* or Cm of a certain CSX sensor by using the predefined scan configuration.
* The range for sensor measuring is 1 to 200 pF for CSD/CSX sensors and
* 1600 pF for shield electrodes.
* The function performs the CSD or CSX scan with fixed reference CDAC values
* (100u and 50u respectively) and 200u for shield electrodes' capacitance
* measurements. The function stores the Cp or Cm value
* in the corresponding element
* of the cy_capsense_snsCap[CY_CAPSENSE_SENSOR_COUNT] array and
* Cshield values for each channel
* in the corresponding element
* of the cy_capsense_shieldCap[CY_CAPSENSE_TOTAL_CH_NUMBER] array.
* The pointer to the first sensor capacitance value of a widget is
* in the .ptrSnsCapacitance field of the \ref cy_stc_capsense_widget_config_t
* structure.
*
* \param slotId
* Specifies the ID number of the slot to measure sensor capacitance.
* The slot ID should be in the admissible range.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E - The measurement completes
*                              successfully, the result is valid.
* - CY_CAPSENSE_BIST_BAD_PARAM_E - The input parameter is invalid.
* - CY_CAPSENSE_BIST_TIMEOUT_E - The scan reached the timeout. It can be caused
*                              by a measured capacitance short or CSD HW block
*                              failure or invalid configuration. You may need to
*                              repeat the measurement after the issue fix.
*
*******************************************************************************/
static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureCapacitanceSlot(
                uint32_t slotId,
                cy_stc_capsense_context_t * context)
{
    uint64_t cp;
    uint32_t watchdogPeriod;
    cy_en_capsense_bist_status_t result = CY_CAPSENSE_BIST_TIMEOUT_E;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    uint32_t * ptrSnsCap;
    uint32_t rawCountTmp;
    uint32_t chIndex;
    uint32_t slotStcIdx;
    uint32_t wdgtIdx;
    uint32_t snsIdx;

    /* Setup scan parameters: Ref CDAC code for shield or electrode Cp measurement */
    if (CY_CAPSENSE_BIST_CAP_SHIELD_SCAN == context->ptrBistContext->eltdCapScanMode)
    {
        context->ptrBistContext->eltdCapRefCdac = CY_CAPSENSE_BIST_SHIELD_CAP_REF_CDAC_DEFAULT;
    }
    /* The CSD or CSX group is the same for all slot sensors, choose the group by the #0u channel */
    else if (CY_CAPSENSE_CSX_GROUP == context->ptrActiveScanSns[0u].currentSenseMethod)
    {
        context->ptrBistContext->eltdCapRefCdac = CY_CAPSENSE_BIST_MUTUAL_CAP_REF_CDAC_DEFAULT;
    }
    else
    {
        context->ptrBistContext->eltdCapRefCdac = CY_CAPSENSE_BIST_ELTD_CAP_REF_CDAC_DEFAULT;
    }
    /* Perform BIST scan */
    Cy_CapSense_BistMeasureCapacitanceSensorRun(context);
    for (chIndex = 0u; chIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; chIndex++)
    {
        watchdogPeriod = Cy_CapSense_BistWatchdogPeriodCalc(context);
        result = CY_CAPSENSE_BIST_TIMEOUT_E;
        /* Wait for the end of scan and get the raw count */
        while (((ptrCommonCfg->ptrMscChConfig[chIndex].ptrMscBase->INTR & MSC_INTR_MASK_SCAN_Msk) == 0u) &&
                (0u != watchdogPeriod))
        {
            watchdogPeriod--;
        }
        if (0u != watchdogPeriod)
        {
            rawCountTmp = ptrCommonCfg->ptrMscChConfig[chIndex].ptrMscBase->RESULT_FIFO_RD;
            result = CY_CAPSENSE_BIST_SUCCESS_E;
        }
        /* Clear all pending interrupts of the current MSC HW block */
        ptrCommonCfg->ptrMscChConfig[chIndex].ptrMscBase->INTR = CY_CAPSENSE_MSC_INTR_ALL_MSK;
        (void)ptrCommonCfg->ptrMscChConfig[chIndex].ptrMscBase->INTR;
        /* Check for timeout and if no, then calculate capacitance and store the value to the data structure */
        if (CY_CAPSENSE_BIST_TIMEOUT_E != result)
        {
            if (CY_CAPSENSE_BIST_CAP_SHIELD_SCAN != context->ptrBistContext->eltdCapScanMode)
            {
                /* Get the slot index in the slot structure for the current channel */
                slotStcIdx = slotId + ((chIndex + ptrCommonCfg->channelOffset) * CY_CAPSENSE_SLOT_COUNT);
                wdgtIdx = context->ptrScanSlots[slotStcIdx].wdId;
            }
            if ((0u == ((1u << (chIndex + context->ptrCommonConfig->channelOffset)) &
                        context->ptrBistContext->skipChannelMask)) &&
                ((CY_CAPSENSE_BIST_CAP_SHIELD_SCAN == context->ptrBistContext->eltdCapScanMode) ||
                 (CY_CAPSENSE_SLOT_SHIELD_ONLY > wdgtIdx)))
            {
                cp = (uint64_t)CY_CAPSENSE_BIST_CAP_MEAS_CDAC_LSB_FF_DIV_1000 * context->ptrBistContext->eltdCapRefCdac;
                cp *= rawCountTmp;
                cp /= CY_CAPSENSE_CONVERSION_KILO;
                cp /= context->ptrBistContext->eltdCapSubConvNum;
                /* Divide the result by 2 for the FW CSX scanning method */
                if ((CY_CAPSENSE_BIST_CAP_SHIELD_SCAN != context->ptrBistContext->eltdCapScanMode) &&
                    (CY_CAPSENSE_CSX_GROUP == context->ptrActiveScanSns[0u].currentSenseMethod))
                {
                    cp /= CY_CAPSENSE_DIVIDER_TWO;
                }
            }
            else
            {
                cp = 0u;
            }
            /* Store the Cp value in the appropriate structure */
            if ((CY_CAPSENSE_BIST_CAP_SHIELD_SCAN != context->ptrBistContext->eltdCapScanMode) &&
                (CY_CAPSENSE_SLOT_SHIELD_ONLY > wdgtIdx))
            {
                snsIdx = context->ptrScanSlots[slotStcIdx].snsId;
                ptrSnsCap = &context->ptrWdConfig[wdgtIdx].ptrSnsCapacitance[snsIdx];
                if (((uint64_t)CY_CAPSENSE_BIST_CP_MAX_VALUE) < cp)
                {
                    cp = (uint64_t)CY_CAPSENSE_BIST_CP_MAX_VALUE;
                }
                *ptrSnsCap = (uint32_t)cp;
            }
            else if (CY_CAPSENSE_BIST_CAP_SHIELD_SCAN == context->ptrBistContext->eltdCapScanMode)
            {
                ptrSnsCap = &context->ptrBistContext->ptrChShieldCap[chIndex];
                if (((uint64_t)CY_CAPSENSE_BIST_CSH_MAX_VALUE) < cp)
                {
                    cp = (uint64_t)CY_CAPSENSE_BIST_CSH_MAX_VALUE;
                }
                *ptrSnsCap = (uint32_t)cp;
            }
            else
            {
                /* Do nothing */
            }
        }
        else
        {
            break;
        }
    }

    return (result);
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || \
          ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN))) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceSensorRun
****************************************************************************//**
*
* This internal function performs the scan initialization
* and triggers the scan for the sensor or shield electrode capacitance measurement.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the starting execution:
* - CY_CAPSENSE_BIST_HW_BUSY_E - The CSD HW block is successfully started
*                                and is busy with scanning.
* - CY_CAPSENSE_BIST_TIMEOUT_E - The pre-charge of the integration capacitor
*                                reached a timeout.
*
*******************************************************************************/
static void Cy_CapSense_BistMeasureCapacitanceSensorRun(
                cy_stc_capsense_context_t * context)
{
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    MSC_Type * ptrMscHwBase;
    uint32_t chIndex;
    uint32_t sensorFrame[CY_MSC_6_SNS_REGS];

    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
        /* Connect Cmods to the AMUX-BusA in the AMUX mode */
        for (chIndex = 0u; chIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; chIndex++)
        {
            Cy_CapSense_SsConfigPinRegisters(
            context->ptrCommonConfig->ptrMscChConfig[chIndex].portCmod1,
            (uint32_t)context->ptrCommonConfig->ptrMscChConfig[chIndex].pinCmod1,
            CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA);

            Cy_CapSense_SsConfigPinRegisters(
            context->ptrCommonConfig->ptrMscChConfig[chIndex].portCmod2,
            (uint32_t)context->ptrCommonConfig->ptrMscChConfig[chIndex].pinCmod2,
            CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA);
        }
    #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */

    /* Initiate the frame start for all channels */
    for (chIndex = 0u; chIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; chIndex++)
    {
        /* Get the pointer to the MSC channel base register */
        ptrMscHwBase = ptrCommonCfg->ptrMscChConfig[chIndex].ptrMscBase;
        ptrMscHwBase->FRAME_CMD = MSC_FRAME_CMD_START_FRAME_Msk;
    }
    for (chIndex = 0u; chIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; chIndex++)
    {
        /* Get the pointer to the MSC channel base register */
        ptrMscHwBase = ptrCommonCfg->ptrMscChConfig[chIndex].ptrMscBase;
        /* Clear the sensor configuration structure */
        (void)memset(&sensorFrame[0u], 0, sizeof(cy_stc_msc_sensor_config_t));
        /* Get the sensor frame configuration and write it to the MSC HW block to start scan */
        Cy_CapSense_BistGenerateSensorConfig(chIndex, &sensorFrame[0u], context);
        Cy_MSC_ConfigureScan(ptrMscHwBase, CY_MSC_6_SNS_REGS, &sensorFrame[0u]);
    }
}


