RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_selftest_v3.c
    /* Generating the common configuration for the control mux switch control */
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        for (i = 0u; i < context->ptrCommonConfig->numPin; i++)
        {
            if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrPinCfg->chId)
            {
                cswFuncMode |= (0x01uL << ptrPinCfg->padNumber);
            }
            ptrPinCfg++;
        }
        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) &&\
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN))
            ptrPinCfg = context->ptrShieldPinConfig;
            for (i = 0u; i < context->ptrCommonConfig->csdShieldNumPin; i++)
            {
                if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrPinCfg->chId)
                {
                    cswFuncMode |= 0x01uL << ptrPinCfg->padNumber;
                }
                ptrPinCfg++;
            }
        #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) &&\
                   (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)) */
        ptrBaseCfg->CSW_CTL = cswFuncMode;
    #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */
    /* Check for modClk divider value */
    if (1u == context->ptrBistContext->eltdCapModClk)
    {
        ptrBaseCfg->CTL |= MSC_CTL_CLK_MSC_RATIO_Msk;
    }
    else
    {
        ptrBaseCfg->CTL &= ~MSC_CTL_CLK_MSC_RATIO_Msk;
    }
    /* Generating the multi-channel mode for each channel with updating the sensor control registers */
    if (0u != context->ptrCommonConfig->syncMode)
    {
        ptrBaseCfg->SNS_CTL = ((uint32_t)context->ptrCommonConfig->syncMode << MSC_SNS_CTL_MULTI_CH_MODE_Pos);
    }
    /* Generating the common configuration for the BIST epilogue cycle number */
    if (0u < context->ptrBistContext->eltdCapNumEpiCycles)
    {
        ptrBaseCfg->SCAN_CTL2 |= (uint32_t)context->ptrBistContext->eltdCapNumEpiCycles <<
                                                                    MSC_SCAN_CTL2_NUM_EPI_CYCLES_Pos;
    }
    else
    {
        ptrBaseCfg->SCAN_CTL2 |= (uint32_t)(1uL << MSC_SCAN_CTL2_NUM_EPI_CYCLES_Pos);
    }
    /* Generating the common configuration for the coarse initialization and coarse short phase */
    if((CY_CAPSENSE_MSC0_CMOD1PADD_PIN == ptrMscChConfig->pinCmod1) ||
       (CY_CAPSENSE_MSC1_CMOD1PADD_PIN == ptrMscChConfig->pinCmod1))
    {
        ptrBaseCfg->INIT_CTL1 |= (uint32_t)context->ptrBistContext->eltdCapNumCoarseInitChargeCycles <<
                                                                    MSC_INIT_CTL1_NUM_INIT_CMOD_12_RAIL_CYCLES_Pos;
        ptrBaseCfg->INIT_CTL1 |= (uint32_t)context->ptrBistContext->eltdCapNumCoarseInitSettleCycles <<
                                                                    MSC_INIT_CTL1_NUM_INIT_CMOD_12_SHORT_CYCLES_Pos;
        ptrBaseCfg->INIT_CTL3 |= CY_CAPSENSE_CMOD12_PAIR_SELECTION << MSC_INIT_CTL3_CMOD_SEL_Pos;
    }
    else
    {
        ptrBaseCfg->INIT_CTL2 |= (uint32_t)context->ptrBistContext->eltdCapNumCoarseInitChargeCycles <<
                                                                    MSC_INIT_CTL2_NUM_INIT_CMOD_34_RAIL_CYCLES_Pos;
        ptrBaseCfg->INIT_CTL2 |= (uint32_t)context->ptrBistContext->eltdCapNumCoarseInitSettleCycles <<
                                                                    MSC_INIT_CTL2_NUM_INIT_CMOD_34_SHORT_CYCLES_Pos;
        ptrBaseCfg->INIT_CTL3 |= (uint32_t)CY_CAPSENSE_CMOD34_PAIR_SELECTION << MSC_INIT_CTL3_CMOD_SEL_Pos;
    }
    /*
     * Generating the common configuration for the number of sub-conversions to be run during the PRO_DUMMY phase and
     * the modClk period number during the PRO_WAIT phase.
     */
    ptrBaseCfg->INIT_CTL4 |= (((uint32_t)context->ptrBistContext->eltdCapNumFineInitCycles <<
                                                                  MSC_INIT_CTL4_NUM_PRO_DUMMY_SUB_CONVS_Pos) |
                              ((uint32_t)context->ptrBistContext->eltdCapNumFineInitWaitCycles <<
                                                                  MSC_INIT_CTL4_NUM_PRO_WAIT_CYCLES_Pos));
}


/*******************************************************************************
* Function Name: Cy_CapSense_BistGenerateSensorConfig
****************************************************************************//**
*
* Generates the configuration for registers that have to be configured to start
* a scan for a single sensor. It is used the next sensor configuration for BIST
* scan:
* - CIC2 filter is off
* - is used mode structure 0u
* - Multi-channel mode is off
* - System level chopping is off
* - Coarse Init Bypass is off
*
* \param chIndex
* The channel index the sensor configuration is generated for.
*
* \param ptrSensorCfg
* Specifies the pointer to the sensor configuration to be filled.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
static void Cy_CapSense_BistGenerateSensorConfig(
                uint32_t chIndex,
                uint32_t * ptrSensorCfg,
                cy_stc_capsense_context_t * context)
{
    uint16_t snsClkDividerVal;
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        uint32_t i;
        const cy_stc_capsense_electrode_config_t * ptrEltdCfg;
        uint32_t padMask = 0u;
        uint32_t cswFuncNum;
        uint32_t slotStcWdgtIdx = context->ptrScanSlots[context->ptrBistContext->curBistSlotId +
                ((chIndex + context->ptrCommonConfig->channelOffset) * CY_CAPSENSE_SLOT_COUNT)].wdId;
    #else
        (void) chIndex;
    #endif

    /* Set the synchronization mode */
    if (0u != context->ptrCommonConfig->syncMode)
    {
        ptrSensorCfg[CY_CAPSENSE_SNS_CTL_INDEX] = ((uint32_t)context->ptrCommonConfig->syncMode << MSC_SNS_CTL_MULTI_CH_MODE_Pos);
    }
    /* Getting the BIST sense clock divider */
    snsClkDividerVal = context->ptrBistContext->eltdCapSnsClk;
    if (CY_CAPSENSE_BIST_CAP_SHIELD_SCAN == context->ptrBistContext->eltdCapScanMode)
    {
        snsClkDividerVal = CY_CAPSENSE_BIST_SHIELD_CAP_SNSCLK_DIV_DEFAULT;
    }
    if (snsClkDividerVal > 0u)
    {
        snsClkDividerVal -= 1u;
    }
    /* Set snsClk and Valid, Start scan, and Last slot bits */
    ptrSensorCfg[CY_CAPSENSE_SNS_CTL_INDEX] |= ((((uint32_t)snsClkDividerVal) << MSC_SNS_CTL_SENSE_DIV_Pos) |
                                                MSC_SNS_CTL_VALID_Msk |
                                                MSC_SNS_CTL_START_SCAN_Msk |
                                                MSC_SNS_CTL_LAST_Msk);
    /*
     * Set the sense mode selection.
     * For the electrode capacitance measurement only the CSD mode is used (SENSE_MODE_SEL = 0u).
     * For the slot sensor capacitance measurement the CSD mode can be used (SENSE_MODE_SEL = 0u) and
     * the CSX mode can be used (SENSE_MODE_SEL = 1u) depending on the measured slot.
     */
    if ((CY_CAPSENSE_BIST_CAP_SLOT_SCAN == context->ptrBistContext->eltdCapScanMode) &&
        (CY_CAPSENSE_CSX_GROUP == context->ptrActiveScanSns[0u].currentSenseMethod))
    {
        ptrSensorCfg[CY_CAPSENSE_SNS_CTL_INDEX] |= (1u << MSC_SNS_CTL_SENSE_MODE_SEL_Pos);
    }
    /*
     * CapDAC configuration: CapDAC dithering is off for BIST,
     * only the reference CDAC is used for BIST scans.
     */
    ptrSensorCfg[CY_CAPSENSE_SNS_CDAC_CTL_INDEX] =
                (((uint32_t)context->ptrBistContext->eltdCapRefCdac) << MSC_SNS_CDAC_CTL_SEL_RE_Pos) |
                MSC_SNS_CDAC_CTL_CLOCK_REF_RATE_Msk;
    /* Compensation CDAC Divider set to BIST Sns clock divider */
    ptrSensorCfg[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] |= (((uint32_t)snsClkDividerVal) << MSC_SNS_SCAN_CTL_COMP_DIV_Pos);
    /* Number of sub-conversions */
    ptrSensorCfg[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] |= ((uint32_t)context->ptrBistContext->eltdCapSubConvNum - 1u) << MSC_SNS_SCAN_CTL_NUM_SUB_CONVS_Pos;

