RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_selftest_v3.c
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        /* Get mask for all channel pins */
        padMask = context->ptrCommonConfig->ptrMscChConfig[chIndex].ptrMscBase->CSW_CTL;
        /* Change the control switch function depending on the current inactive sensor connection */
        cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_GND;
        if (CY_CAPSENSE_BIST_IO_HIGHZA_E == context->ptrBistContext->currentISC)
        {
            cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_HIGH_Z;
        }
        else if (CY_CAPSENSE_BIST_IO_SHIELD_E == context->ptrBistContext->currentISC)
        {
            cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_SHIELD;
        }
        else
        {
            /* Do nothing */
        }
        /* Set the control mux switch registers for inactive pins */
        Cy_CapSense_CalculateMaskRegisters(padMask, cswFuncNum, ptrSensorCfg);
        /* Check for active electrodes */
        if (0u == ((1u << (chIndex + context->ptrCommonConfig->channelOffset)) &
                    context->ptrBistContext->skipChannelMask))
        {
            if ((CY_CAPSENSE_BIST_CAP_ELTD_SCAN == context->ptrBistContext->eltdCapScanMode) ||
                (CY_CAPSENSE_BIST_CAP_SHIELD_SCAN == context->ptrBistContext->eltdCapScanMode) ||
                ((CY_CAPSENSE_BIST_CAP_SLOT_SCAN == context->ptrBistContext->eltdCapScanMode) &&
                 ((CY_CAPSENSE_SLOT_EMPTY != slotStcWdgtIdx) && (CY_CAPSENSE_SLOT_SHIELD_ONLY != slotStcWdgtIdx))))
            {
                /* Initializes an active sensor (including ganged sensors) by SNS sensor state */
                if (CY_CAPSENSE_BIST_CAP_SHIELD_SCAN == context->ptrBistContext->eltdCapScanMode)
                {
                    /* Generate CTRL_MUX masks for the electrode or CSD sensor connection */
                    cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_SNS;
                    if (CY_CAPSENSE_BIST_IO_SHIELD_E == context->ptrBistContext->currentISC)
                    {
                        padMask = context->ptrCommonConfig->ptrMscChConfig[chIndex].ptrMscBase->CSW_CTL;
                    }
                    else
                    {
                        padMask = 0u;
                        for (i = 0u; i < context->ptrCommonConfig->csdShieldNumPin; i++)
                        {
                            /* Proceed only if the shield electrode is connected belongs to the current channel */
                            if ((chIndex + context->ptrCommonConfig->channelOffset) == context->ptrShieldPinConfig[i].chId)
                            {
                                padMask |= 0x01uL << context->ptrShieldPinConfig[i].padNumber;
                            }
                        }
                    }
                    Cy_CapSense_CalculateMaskRegisters(padMask, cswFuncNum, ptrSensorCfg);
                }
                else
                {
                    if ((CY_CAPSENSE_BIST_CAP_ELTD_SCAN == context->ptrBistContext->eltdCapScanMode) ||
                        (CY_CAPSENSE_CSD_GROUP == context->ptrActiveScanSns[0u].currentSenseMethod))
                    {
                        /* Generate CTRL_MUX masks for the electrode or CSD sensor connection */
                        if (CY_CAPSENSE_BIST_CAP_ELTD_SCAN == context->ptrBistContext->eltdCapScanMode)
                        {
                            ptrEltdCfg = context->ptrBistContext->curPtrEltdCfg;
                        }
                        else
                        {
                            ptrEltdCfg = context->ptrActiveScanSns[chIndex].ptrEltdConfig;
                        }
                        cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_SNS;
                        /* Proceed only if electrode configuration belongs to selected channel */
                        if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrEltdCfg->chId)
                        {
                            Cy_CapSense_BistGenerateSnsCfgMaskReg(ptrEltdCfg, ptrSensorCfg, cswFuncNum);
                        }
                    }
                    else
                    {
                        /* RX ELECTRODE */
                        if (CY_CAPSENSE_SLOT_SHIELD_ONLY > slotStcWdgtIdx)
                        {
                            cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_RX;
                            ptrEltdCfg = context->ptrActiveScanSns[chIndex].ptrRxConfig;
                            if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrEltdCfg->chId)
                            {
                                Cy_CapSense_BistGenerateSnsCfgMaskReg(ptrEltdCfg, ptrSensorCfg, cswFuncNum);
                            }
                        }
                        /* TX ELECTRODE */
                        cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_TX;
                        ptrEltdCfg = context->ptrActiveScanSns[chIndex].ptrTxConfig;
                        if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrEltdCfg->chId)
                        {
                            Cy_CapSense_BistGenerateSnsCfgMaskReg(ptrEltdCfg, ptrSensorCfg, cswFuncNum);
                        }
                    }
                }
            }
        }
    #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */
}

#if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
/*******************************************************************************
* Function Name: Cy_CapSense_BistGenerateSnsCfgMaskReg
****************************************************************************//**
*
* Calculates the configuration for all sensor configuration mask registers that
* have to be changed to set the desired CTRL-MUX function
* for the specified electrode for BIST scan.
*
* \param ptrEltdCfg
* The pointer to the specified electrode configuration
* \ref cy_stc_capsense_electrode_config_t structure.
*
* \param ptrSensorCfg
* Specifies the pointer to the sensor configuration to be filled.
*
* \param cswFuncNum
* The desired CTRL-MUX Switch Control Global function.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
static void Cy_CapSense_BistGenerateSnsCfgMaskReg(
                const cy_stc_capsense_electrode_config_t * ptrEltdCfg,
                uint32_t * ptrSensorCfg,
                uint32_t cswFuncNum)
{
    uint32_t padMask = 0u;
    uint32_t i;

    /* Loop through all pads for this electrode (ganged sensor) */
    for (i = 0u; i < ptrEltdCfg->numPins; i++)
    {
        padMask |= 0x01uL << ptrEltdCfg->ptrPin[i].padNumber;
    }
    Cy_CapSense_CalculateMaskRegisters(padMask, cswFuncNum, ptrSensorCfg);
}
#endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN) */


