RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_selftest_v3.c
#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) &&\
        (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_MeasureCapacitanceShieldElectrode
****************************************************************************//**
*
* Measures shield electrode capacitances in femtofarads.
*
* This function measures the capacitances of all shield electrodes for all
* enabled MSCv3 channels and returns a status of this measurement.
* The function checks if there is any CSD widget in the project and
* if the shield is enabled.
* The measurement results in femtofarads are stored
* in the chShieldCap[CY_MSC_ENABLED_CH_NUMBER] array.
* The pointer to the array is in the .ptrChShieldCap field
* of the \ref cy_stc_capsense_bist_context_t structure,
* the CY_MSC_ENABLED_CH_NUMBER define is in the cycfg_peripherals.h file.
* If the any channel shield consists of several electrodes, the total
* capacitance of all the shield electrodes is measured.
*
* This function uses an algorithm identical to the electrode capacitance
* measurement. Refer to the Cy_CapSense_MeasureCapacitanceSensorElectrode()
* function for more details.
*
* In addition to measuring shield capacitance, this function is used to
* identify various fault conditions with shield electrodes such as an
* electrically-open or -short shield electrodes, e.g. the PCB track is broken or
* shorted to other nodes in the system - in all of these conditions,
* this function returns changed capacitance that can be compared
* against pre-determined capacitance for the shield electrode to
* detect a hardware fault.
*
* By default, all CAPSENSE&trade; sensors (electrodes) that are not being
* measured are set to the GND state.
* The inactive state can be changed in run-time by using
* the Cy_CapSense_SetInactiveElectrodeState() function.
* When the inactive sensor (electrode) connection is set
* to the CY_CAPSENSE_SNS_CONNECTION_SHIELD state,
* all the CAPSENSE&trade; electrodes are connected to the shield and
* the total capacitance are measured.
*
* By default, the both Cmod1 and Cmod2 capacitors are used for the measurement.
*
* This test can be executed using the CapSense_RunSelfTest()
* function with the CY_CAPSENSE_BIST_SHIELD_CAP_MASK mask.
*
* \note
* This function is available only for the fifth-generation CAPSENSE&trade;.
*
* \param skipChMask
* Specifies the mask to skip some channels during the shield electrode
* capacitance measurement. If the bit N in the skipChMask is set to 1,
* the channel N will be excluded from measuring and all its shield pins will be
* set to the shield inactive sensor connection state (see the .shieldCapISC
* field of the \ref cy_stc_capsense_bist_context_t structure).
*
* \param context
* The pointer to the CAPSENSE&trade; context
* structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E          - The measurement completes
*                                         successfully, the result is valid.
* - CY_CAPSENSE_BIST_BAD_PARAM_E        - The input parameter is invalid.
*                                         The measurement was not executed.
* - CY_CAPSENSE_BIST_HW_BUSY_E          - The CSD HW block is busy with a
*                                         previous operation.
*                                         The measurement was not executed.
* - CY_CAPSENSE_BIST_BAD_CONFIG_E       - The shield is disabled.
*
*******************************************************************************/
cy_en_capsense_bist_status_t Cy_CapSense_MeasureCapacitanceShieldElectrode(
                uint32_t skipChMask,
                cy_stc_capsense_context_t * context)
{
    cy_en_capsense_bist_status_t result = CY_CAPSENSE_BIST_BAD_PARAM_E;

    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
        uint32_t pinIndex;
        const cy_stc_capsense_pin_config_t * ptrPinCfg;
    #endif

    if(NULL != context)
    {
    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) &&\
         (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_SHIELD_EN))
        if ((0u < context->ptrCommonConfig->csdShieldNumPin) ||
            (CY_CAPSENSE_BIST_IO_SHIELD_E == context->ptrBistContext->intrEltdCapShieldISC))
        {
            context->ptrBistContext->currentISC = context->ptrBistContext->intrEltdCapShieldISC;
            if (CY_CAPSENSE_NOT_BUSY == Cy_CapSense_IsBusy(context))
            {
                /* Set the BUSY status */
                context->ptrCommonContext->status = CY_CAPSENSE_BUSY | CY_CAPSENSE_MW_STATE_BIST_MASK;
                (void)Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_BIST_FUNCTIONALITY, context);
                /* Store the current slot and the skip channel mask for the BIST scan */
                context->ptrBistContext->curBistSlotId = 0u;
                context->ptrBistContext->skipChannelMask = (uint8_t)skipChMask;
                /* Switch the HW resource configuration to the electrode capacitance measurement */
                Cy_CapSense_BistSwitchHwConfig(CY_CAPSENSE_BIST_HW_ELTD_CAP_E,
                                               CY_CAPSENSE_CSD_GROUP,
                                               CY_CAPSENSE_BIST_CAP_SHIELD_SCAN,
                                               context);
                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                    /* Connect all shield pins as sensors for CSD BIST scan */
                    if (0u < context->ptrCommonConfig->csdShieldNumPin)
                    {
                        ptrPinCfg = context->ptrShieldPinConfig;
                        for (pinIndex = 0u; pinIndex < context->ptrCommonConfig->csdShieldNumPin; pinIndex++)
                        {
                            if (((0x01uL << ptrPinCfg->chId) & skipChMask) == 0u)
                            {
                                Cy_CapSense_SsConfigPinRegisters(ptrPinCfg->pcPtr, (uint32_t)ptrPinCfg->pinNumber,
                                                                 CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_CSD_SENSE);
                            }
                            ptrPinCfg++;
                        }
                    }
                    if (CY_CAPSENSE_BIST_IO_SHIELD_E == context->ptrBistContext->currentISC)
                    {
                        /* Connect all sensor pins for CSD BIST scan */
                        ptrPinCfg = context->ptrPinConfig;
                        for (pinIndex = 0u; pinIndex < context->ptrCommonConfig->numPin; pinIndex++)
                        {
                            if (((0x01uL << ptrPinCfg->chId) & skipChMask) == 0u)
                            {
                                Cy_CapSense_SsConfigPinRegisters(ptrPinCfg->pcPtr, (uint32_t)ptrPinCfg->pinNumber,
                                                                 CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_CSD_SENSE);
                            }
                            ptrPinCfg++;
                        }
                    }
                #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */
                /* Perform the CSD BIST slot scan with connected all channel shields as active electrodes */
                result = Cy_CapSense_BistMeasureCapacitanceSlot(0u, context);
                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                    /* Disconnect all shield pins by setting them to the current BIST ISC */
                    if (0u < context->ptrCommonConfig->csdShieldNumPin)
                    {
                        ptrPinCfg = context->ptrShieldPinConfig;
                        for (pinIndex = 0u; pinIndex < context->ptrCommonConfig->csdShieldNumPin; pinIndex++)
                        {
                            if (((0x01uL << ptrPinCfg->chId) & skipChMask) == 0u)
                            {
                                Cy_CapSense_SsConfigPinRegisters(ptrPinCfg->pcPtr,
                                                                 (uint32_t)ptrPinCfg->pinNumber,
                                                                 context->ptrBistContext->eltdInactiveDm,
                                                                 context->ptrBistContext->eltdInactiveHsiom);
                            }
                            ptrPinCfg++;
                        }
                    }
                    if (CY_CAPSENSE_BIST_IO_SHIELD_E == context->ptrBistContext->currentISC)
                    {
                        /* Disconnect all sensor pins by setting them to the current BIST ISC */
                        ptrPinCfg = context->ptrPinConfig;
                        for (pinIndex = 0u; pinIndex < context->ptrCommonConfig->numPin; pinIndex++)
                        {
                            if (((0x01uL << ptrPinCfg->chId) & skipChMask) == 0u)
                            {
                                Cy_CapSense_SsConfigPinRegisters(ptrPinCfg->pcPtr,
                                                                 (uint32_t)ptrPinCfg->pinNumber,
                                                                 context->ptrBistContext->eltdInactiveDm,
                                                                 context->ptrBistContext->eltdInactiveHsiom);
                            }
                            ptrPinCfg++;
                        }
                    }
                #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */
                /* Clear the BUSY flag */
                context->ptrCommonContext->status = CY_CAPSENSE_NOT_BUSY;
            }
            else
            {
                result = CY_CAPSENSE_BIST_HW_BUSY_E;
            }
        }
    #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) &&\
               (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)) */
    }

    return (result);
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) &&\
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN)) */


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN) && \
     (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD))
/*******************************************************************************
* Function Name: Cy_CapSense_BistConnectEltd
****************************************************************************//**
*
* Connects a specified electrode as CSD sensor to the BIST active MSC HW block.
*
* The function connects all the electrode pins including ganged.
* The BIST active MSC HW block is specified
* in the \ref cy_stc_capsense_bist_context_t structure.
*
* \param ptrEltdConfig
* The pointer to the specified electrode configuration
* \ref cy_stc_capsense_electrode_config_t structure.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistConnectEltd(
                const cy_stc_capsense_electrode_config_t * ptrEltdConfig,
                const cy_stc_capsense_context_t * context)
{
    const cy_stc_capsense_pin_config_t * ptrActivePin = ptrEltdConfig->ptrPin;
    uint32_t i;

    if((context->ptrBistContext->curBistChId + context->ptrCommonConfig->channelOffset) == ptrEltdConfig->chId)
    {
        /* Connect all pins of current sensors */
        for(i = 0u; i < ptrEltdConfig->numPins; i++)
        {
            Cy_CapSense_SsConfigPinRegisters(ptrActivePin->pcPtr, (uint32_t)ptrActivePin->pinNumber,
                    CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_CSD_SENSE);
            ptrActivePin++;
        }
    }
}


