RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_selftest_v3.c
/*******************************************************************************
* Function Name: Cy_CapSense_BistDisconnectEltd
****************************************************************************//**
*
* The function disconnects all the electrode pins including ganged.
* The BIST active MSC HW block is specified
* in the \ref cy_stc_capsense_bist_context_t structure.
*
* \param ptrEltdConfig
* The pointer to the specified electrode configuration
* \ref cy_stc_capsense_electrode_config_t structure.
*
* \param desiredPinState
* Specifies the desired pin state. See the possible states
* in the cy_en_capsense_bist_io_state_t enum description.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistDisconnectEltd(
                const cy_stc_capsense_electrode_config_t * ptrEltdConfig,
                cy_en_capsense_bist_io_state_t desiredPinState,
                const cy_stc_capsense_context_t * context)
{
    const cy_stc_capsense_pin_config_t * ptrActivePin = ptrEltdConfig->ptrPin;
    uint32_t i;
    uint32_t desiredDriveMode = CY_CAPSENSE_DM_GPIO_ANALOG;
    en_hsiom_sel_t desiredHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;

    if((context->ptrBistContext->curBistChId + context->ptrCommonConfig->channelOffset) == ptrEltdConfig->chId)
    {
        /* Change Drive mode and HSIOM depending on the current inactive sensor connection */
        if (CY_CAPSENSE_BIST_IO_STRONG_E == desiredPinState)
        {
            desiredDriveMode = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
            desiredHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;
        }
        else if (CY_CAPSENSE_BIST_IO_HIGHZA_E == desiredPinState)
        {
            /* Do nothing */
        }
        else if (CY_CAPSENSE_BIST_IO_SHIELD_E == desiredPinState)
        {
            desiredDriveMode = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
            desiredHsiom = CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD;
        }
        else
        {
            /* Do nothing */
        }
        /* Disconnect all pins of the current sensor */
        for(i = 0u; i < ptrEltdConfig->numPins; i++)
        {
            Cy_CapSense_SsConfigPinRegisters(ptrActivePin->pcPtr, (uint32_t)ptrActivePin->pinNumber,
                                             desiredDriveMode, desiredHsiom);
            Cy_GPIO_Clr(ptrActivePin->pcPtr, (uint32_t)ptrActivePin->pinNumber);
            ptrActivePin++;
        }
    }
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN) && \
           (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)) */


/*******************************************************************************
* Function Name: Cy_CapSense_BistInitialize
****************************************************************************//**
*
* The internal function initializes some critical parameters
* for Built-in Self-test (BIST) mode.
*
* This function prepares the resource capturing to execute the BIST functions.
* The HW resource configuring is performed by the Cy_CapSense_BistSwitchHwConfig()
* function depending on a the type of the test to be executed.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_BistInitialize(cy_stc_capsense_context_t * context)
{
    /*
     * This function prepares the BIST HW and pins re-configuring by setting some
     * critical internal parameters to undefined states.
     * Use this function after switching from CSD or CSX sensing modes.
     */
    context->ptrBistContext->hwConfig = CY_CAPSENSE_BIST_HW_UNDEFINED_E;
    context->ptrBistContext->currentISC = CY_CAPSENSE_BIST_IO_UNDEFINED_E;
    context->ptrBistContext->eltdCapSenseGroup = CY_CAPSENSE_UNDEFINED_GROUP;
}


/*******************************************************************************
* Function Name: Cy_CapSense_BistDsInitialize_V3
****************************************************************************//**
*
* This internal function initializes the BIST cy_stc_capsense_bist_context_t
* data structure parameters to be used in the test execution.
*
* The function is called once at the CAPSENSE&trade; start and performs
* the \ref cy_stc_capsense_bist_context_t structure initialization based
* on the configured parameters.
*
* Some of the parameters of the \ref cy_stc_capsense_bist_context_t structure
* can be changed in the run-time, but some changes require repeating the call
* of this function to the re-calculate register values.
* Refer to description of the following functions which parameters are used
* as an input and which are outputs:
* * Cy_CapSense_BistMeasureCapacitanceSensorInit()
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_BistDsInitialize_V3(cy_stc_capsense_context_t * context)
{
    uint32_t wdIndex;
    uint32_t wdNum = (uint32_t)context->ptrCommonConfig->numWd;

    /* Initialize CRC and status for all widgets */
    for (wdIndex = 0u; wdIndex < wdNum; wdIndex++)
    {
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN)
            Cy_CapSense_UpdateCrcWidget(wdIndex, context);
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN)) */
        context->ptrWdContext[wdIndex].status |= (uint8_t)CY_CAPSENSE_WD_WORKING_MASK;
    }

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN)
        Cy_CapSense_BistMeasureCapacitanceSensorInit(context);
    #endif

    context->ptrBistContext->hwConfig = CY_CAPSENSE_BIST_HW_UNDEFINED_E;
    context->ptrBistContext->currentISC = CY_CAPSENSE_BIST_IO_UNDEFINED_E;
    context->ptrBistContext->eltdCapSenseGroup = CY_CAPSENSE_UNDEFINED_GROUP;
    context->ptrBistContext->intrEltdCapCsdISC = context->ptrBistContext->eltdCapCsdISC;
    context->ptrBistContext->intrEltdCapCsxISC = context->ptrBistContext->eltdCapCsxISC;
    context->ptrBistContext->intrEltdCapShieldISC = context->ptrBistContext->shieldCapISC;
}


